upstream/OpenFOAM-v2606/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

__thermalShell
{
    thermalShellModel   thermalShell;

    // Thermal properties
    thermo
    {
        rho             1000;
        kappa           200;
        Cp              600;
        emissivity      0;
    }

    qr      qr;     // radiation

    // Tprimary : volume temperature
}


boundaryField
{
    "floor.*"
    {
        type            fixedValue;
        value           uniform 700;
    }

    "ceiling.*"
    {
        type            compressible::thermalShell;
        value           uniform 300;

        active              true;
        region              upper;
        //suffixing           default;

        ${__thermalShell}

        // Thickness (default and/or as field)
        thickness   1e-3;
        h           hs;

        // Field names
        // Ts       : shell temperature
        // Tprimary : volume temperature
    }

    "fixedWall.*"
    {
        type            zeroGradient;
    }
}

#remove __thermalShell

// ************************************************************************* //
