upstream/OpenFOAM-v2606/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/system/finite-area/faOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// General notes:
//
// Optional region suffixing:
//   suffixing       default;
//   suffixing       _shell;   // If used for region-model
//
// Shell temperature:
//   Ts       Ts;
//   Ts       Ts_region;
//
// Volume temperature:
//   Tprimary T;

// For externalHeatFluxSource:

outside
{
    type            externalHeatFluxSource;
    active          true;
    region          upper;
    selectionMode   all;

    // Optional region suffixing:
    //suffixing       default;
    //suffixing       _shell;   // If used for region-model

    //Ts             Ts;
    //Tprimary       T;

    mode            coefficient;
    Ta              constant 290;
    h               10;
}

// contactHeatFluxSource is the coupling of the shell-2D and the 3D mesh
contact
{
    type            contactHeatFluxSource;
    active          true;
    region          upper;
    selectionMode   all;

    // Optional region suffixing:
    //suffixing       default;
    //suffixing       _shell;   // If used for region-model

    //Ts             Ts;
    //Tprimary       T;

    kappaMethod     fluidThermo;

    thicknessLayers (0.001);
    kappaLayers     (0.02);
}


//************************************************************************** //
